# 빈 자리는 빈 공간으로 두고 오른쪽 정렬을 하되, 총 10자리 공간 확보
print('{0: >10}'.format(500))

# 빈 자리는 빈 공간으로 두고 오른쪽 정렬을 하되, 총 10자리 공간 확보, 양수일 때는 + 표시, 음수일 때는 - 표시
print('{0: >+10}'.format(500))
print('{0: >+10}'.format(-500))

# 왼쪽 정렬, 빈칸은 밑줄(_)로 채움
print('{0:_<10}'.format(500))
print('{0:_<+10}'.format(500))
print('{0:_<+10}'.format(-500))

# 3자리 마다 콤마 찍어주기
print('{0:,}'.format(1000000000000000))
# 3자리 마다 콤마 찍어주기, 부호도
print('{0:+,}'.format(1000000000000000))
print('{0:+,}'.format(-1000000000000000))

# 3자리 마다 콤마, 부호, 자릿수 확보
# 돈이 많으면 행복하니까 빈 자리는 ^표시로
print('{0:^<+30,}'.format(10000000000000000))

# 소수점 출력
print('{0:f}'.format(5/3))
# 소수점을 특정 자리수 까지만 출력
print('{0:.2f}'.format(5/3)) # 둘째 자리까지 (소수점 3째자리에서 반올림)